#name = 'Сейчас на Земле появился новый вид роботов. Раньше их называли „железной оравой “, но это не очень точное определение' # Задача «Часть от целого».
#print(len(name))
#print(name [0:44]) # Задача «Часть от целого».

#name = 'радар' # Задача «Палиндром».
#print(name[::-1]) # Задача «Палиндром».
#print(len(name))
#name1 = 'норма' # Задача «Палиндром».
#print(len(name1))
#print(name1[::-1]) # Задача «Палиндром».

#name = 'кенгуру'  # Задача «Равные части».
#print(len(name))
#print(name[4:7],name[0:4]) # Задача «Равные части».

#name = 'нейропрограммирование'  # Задача «Четные и нечетные».
#print(len(name))
#print(name[::2],name[1::2]) # Задача «Четные и нечетные».

#name = 'нейропластичность'  # Задача «Обратный порядок».
#print(len(name))
#print(name[16:0:-1]) # Задача «Обратный порядок».